tutorials/buoyantSimpleFoam-aster/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



convertToMeters 1;

vertices
(

    (0 .25 0)
    (1 .25 0)
    (1 .75 0)
    (0 .75 0)
    
    (0 .25 .4)
    (1 .25 .4)
    (1 .75 .4)
    (0 .75 .4)

    (3 .25 0)
    (3 .75 0)
    
    (3 .25 .4)
    (3 .75 .4)
    
    (-.5 .25 0)
    (-.5 .75 0)
    
    (-.5 .75 .4)
    (-.5 .25 .4)
    
);

blocks
(
    hex (12 0 3 13 15 4 7 14) (81 41 4) simpleGrading (.2 15 1)
    hex (0 1 2 3 4 5 6 7) (161 41 4) simpleGrading (5 15 1)
    hex (1 8 9 2 5 10 11 6) (51 41 4) simpleGrading (1 15 1)
);

edges
(
);

boundary
(

    inlet
    {
        type wall;
        faces
        (
        	(13 12 15 14)
//        	(0 4 7 3)
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
        	(8 9 11 10)
        );
    }
    
    top
    {
        type wall;
        faces
        (
        	(7 6 2 3)
        	(9 2 6 11)
        	(13 3 7 14)
        );
    }
    
    slip-bottom
    {
        type wall;
        faces
        (
        	(15 12 0 4)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
        	(1 8 10 5)
        );
    }
    
    interface
    {
        type wall;
        faces
        (
        	(4 0 1 5)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
