tutorials/buoyantSimpleFoam-aster/fluid/system/changeDictionary-12
// Re = 10000.0, Pr = 100, k = 20
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      changeDictionaryDict;
}

dictionaryReplacement
{
    thermophysicalProperties
    {
        mixture
        {
        	specie
        	{
        		molWeight       24.0998901449;
        	}
        	thermodynamics
        	{
        		Cp              50000000.0;
        	}
        	transport
        	{
        		mu              1e-05;
        		Pr              100; 
        	}
        }
    }
}
