tutorials/buoyantSimpleFoam-aster/fluid/system/changeDictionary-6
// Re = 500, Pr = 100, k = 20
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      changeDictionaryDict;
}

dictionaryReplacement
{
    thermophysicalProperties
    {
        mixture
        {
        	specie
        	{
        		molWeight       24.0998901449;
        	}
        	thermodynamics
        	{
        		Cp              2500000.0;
        	}
        	transport
        	{
        		mu              0.0002;
        		Pr              100; 
        	}
        }
    }
}
